# ArcLengthDimensionReferencesNotIntersect Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..ArcLengthDimensionReferencesNotIntersect Property
BuiltInFailures..::..DimensionFailures Class See Also
---
One or more dimension references of this Arc Length dimension no longer intersect the circle needed for arc length computation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ArcLengthDimensionReferencesNotIntersect { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArcLengthDimensionReferencesNotIntersect As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ArcLengthDimensionReferencesNotIntersect {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace